{
  "users": [
    {
      "id": 1,
      "userName": "admin",
      "address": "Mock Street",
      "email": "admin@gmail.com",
      "password": "admin",
      "phone": "+551140028922",
      "admin": true
    },
    {
      "id": 2,
      "userName": "David Cairuz",
      "address": "Rua do David",
      "email": "david@gmail.com",
      "password": "david",
      "admin": true,
      "phone": "+5511123456789"
    },
    {
      "id": 3,
      "userName": "fakhoury",
      "address": "Rua do Fakhoury",
      "email": "andre@gmail.com",
      "password": "fakhoury",
      "phone": "+5514321456789",
      "admin": false
    },
    {
      "id": 4,
      "userName": "joaogui1",
      "address": "Joao Guilherme Rua",
      "email": "joaogui1@gmail.com",
      "password": "joaoguilherme",
      "phone": "+5516321456789",
      "admin": true
    }
  ],
  "books": [
    {
      "title": "In Search of Lost Time",
      "author": "Marcel Proust",
      "description": "Swann's Way, the first part of A la recherche de temps perdu, Marcel Proust's seven-part cycle, was published in 1913. In it, Proust introduces the themes that run through the entire work. The narrator recalls his childhood, aided by the famous madeleine; and describes M. Swann's passion for Odette. The work is incomparable. Edmund Wilson said \"[Proust] has supplied for the first time in literature an equivalent in the full scale for the new theory of modern physics.\"",
      "category": "classics",
      "qttStock": 10,
      "qttSold": 0,
      "price": 14.29,
      "img": "search_of_lost_time.jpeg",
      "id": 1
    },
    {
      "title": "Dune",
      "author": "Frank Herbert",
      "description": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, who would become the mysterious man known as Maud'dib. He would avenge the traitorous plot against his noble family - and would bring to fruition humankind's most ancient and unattainable dream.   A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.   Frank Herbert's death in 1986 was a tragic loss, yet the astounding legacy of his visionary fiction will live forever. ",
      "category": "fantasy",
      "qttStock": 9,
      "qttSold": 0,
      "price": 20.99,
      "img": "dune.jpeg",
      "id": 2
    },
    {
      "title": "Hamlet",
      "author": "William Shakespeare",
      "description": "The Tragedy of Hamlet, Prince of Denmark, or more simply Hamlet, is a tragedy by William Shakespeare, believed to have been written between 1599 and 1601. The play, set in Denmark, recounts how Prince Hamlet exacts revenge on his uncle Claudius, who has murdered Hamlet's father, the King, and then taken the throne and married Gertrude, Hamlet's mother. The play vividly charts the course of real and feigned madness—from overwhelming grief to seething rage—and explores themes of treachery, revenge, incest, and moral corruption.",
      "category": "classics",
      "qttStock": 10,
      "qttSold": 0,
      "price": 6.29,
      "img": "hamlet.jpeg",
      "id": 3
    },
    {
      "title": "The Divine Comedy",
      "author": "Dante Alighieri",
      "description": "Belonging in the immortal company of the great works of literature, Dante Alighieri's poetic masterpiece, The Divine Comedy, is a moving human drama, an unforgettable visionary journey through the infinite torment of Hell, up the arduous slopes of Purgatory, and on to the glorious realm of Paradise — the sphere of universal harmony and eternal salvation.",
      "category": "classics",
      "qttStock": 10,
      "qttSold": 0,
      "price": 6.95,
      "img": "divine_comedy.jpeg",
      "id": 4
    },
    {
      "title": "The Golden Compass",
      "author": "Philip Pullman",
      "description": "Philip Pullman takes listeners to a world where humans have animal familiars and where parallel universes are within reach.  Lyra is rushing to the cold, far North, where witch clans and armored bears rule. North, where the Gobblers take the children they steal - including her friend Roger. North, where her fearsome uncle Asriel is trying to build a bridge to a parallel world.  Can one small girl make a difference in such great and terrible endeavors? This is Lyra: a savage, a schemer, a liar, and as fierce and true a champion as Roger or Asriel could want.  But what Lyra doesn't know is that to help one of them will be to betray the other....  A masterwork of storytelling and suspense, Philip Pullman's award-winning The Golden Compass is the first in the His Dark Materials series, which continues with The Subtle Knife and The Amber Spyglass.",
      "category": "fantasy",
      "qttStock": 10,
      "qttSold": 0,
      "price": 8.59,
      "img": "91uLA-C1-kL.jpeg",
      "id": 5
    },
    {
      "title": "Alexander Hamilton",
      "author": "Ron Chernow",
      "description": "The inspiration for the hit Broadway musical Hamilton! In the first full-length biography of Alexander Hamilton in decades, National Book Award winner Ron Chernow tells the riveting story of a man who overcame all odds to shape, inspire, and scandalize the newborn America.  According to historian Joseph Ellis, Alexander Hamilton is “a robust full-length portrait, in my view the best ever written, of the most brilliant, charismatic and dangerous founder of them all.”  Few figures in American history have been more hotly debated or more grossly misunderstood than Alexander Hamilton. Chernow’s biography gives Hamilton his due and sets the record straight, deftly illustrating that the political and economic greatness of today’s America is the result of Hamilton’s countless sacrifices to champion ideas that were often wildly disputed during his time.",
      "category": "biography",
      "qttStock": 7,
      "qttSold": 0,
      "price": 10.71,
      "img": "alexander_hamilton.jpeg",
      "id": 6
    },
    {
      "title": "Your Name",
      "author": "Makoto Shinkai",
      "description": "Two teenagers share a profound, magical connection upon discovering they are swapping bodies. Things manage to become even more complicated when the boy and girl decide to meet in person.",
      "category": "comics",
      "qttStock": 10,
      "qttSold": 0,
      "price": 20.9,
      "img": "your-name.-01-Capa_p.jpg",
      "id": 7
    },
    {
      "title": "Heartstopper",
      "author": "Alice Oseman",
      "description": "The story of two British teens, Nick Nelson and Charlie Spring, at an all-boys grammar school. Charlie, a high-strung, openly gay overthinker, and Nick, a cheerful, soft-hearted rugby player, one day are made to sit together in class. Their friendship quickly becomes something more for openly gay Charlie, but he initially does not believe he has a chance with Nick. But love works in surprising ways, and Nick is more interested in Charlie than either of them realized. Heartstopper is about love, friendship, loyalty, and mental illness. It encompasses all the small stories of Nick and Charlie's lives that together make something larger.",
      "category": "comics",
      "qttStock": 10,
      "qttSold": 0,
      "price": 10.25,
      "img": "heartstopper.jpeg",
      "id": 8
    },
    {
      "title": "Wuthering Heights",
      "author": "Emily Brontë",
      "description": "Wuthering Heights is an 1847 novel by Emily Brontë, initially published under her pen name Ellis Bell. It concerns two families of the landed gentry living on the West Yorkshire moors, the Earnshaws and the Lintons, and their turbulent relationships with Earnshaw's foster son, Heathcliff.",
      "category": "romance",
      "qttStock": 10,
      "qttSold": 0,
      "price": 15.95,
      "img": "wuthering.jpg",
      "id": 9
    },
    {
      "title": "Crime and Punishment",
      "author": "Fyodor Dostoyevsky",
      "description": "It is a murder story, told from a murder;s point of view, that implicates even the most innocent reader in its enormities. It is a cat-and-mouse game between a tormented young killer and a cheerfully implacable detective. It is a preternaturally acute investigation of the forces that impel a man toward sin, suffering, and grace. Ever since its publication in 1866 Crime and Punishment has intrigued readers and sorely tested translators, the best of whom seemed to capture one facet of Dostoevsky's masterpiece while missing the rest.",
      "category": "classics",
      "qttStock": 10,
      "qttSold": 0,
      "price": 5.49,
      "img": "dosto.jpeg",
      "id": 10
    },
    {
      "title": "Comedy Comedy Comedy Drama",
      "author": "Bob Odenkirk",
      "description": "In this \"essential\" (Entertainment Weekly), \"hilarious\" (AV Club) memoir, the star of Mr. Show, Breaking Bad, and Better Call Saul opens up about the highs and lows of showbiz, his cult status as a comedy writer, and what it's like to reinvent himself as an action film ass-kicker at fifty. \"I've known Bob Odenkirk for more than thirty years, and yet I had to read this book to believe his stunning career arc.\"--Conan O'Brien",
      "category": "humor",
      "qttStock": 9,
      "qttSold": 0,
      "price": 20.95,
      "img": "comedy.jpeg",
      "id": 11
    },
    {
      "title": "Percy Jackson & the Olympians: The Lightning Thief",
      "author": "Rick Riordan",
      "description": "The Lightning Thief is a 2005 American-fantasy-adventure novel based on Greek mythology, the first young adult novel written by Rick Riordan in the Percy Jackson & the Olympians series. It won the Adult Library Services Association Best Books for Young Adults, among other awards.",
      "category": "fantasy",
      "qttStock": 10,
      "qttSold": 0,
      "price": 15.59,
      "img": "percy.jpeg",
      "id": 12
    },
    {
      "title": "Alan Turing: The Enigma",
      "author": "Andrew Hodges",
      "description": "It is only a slight exaggeration to say that the British mathematician Alan Turing (1912-1954) saved the Allies from the Nazis, invented the computer and artificial intelligence, and anticipated gay liberation by decades--all before his suicide at age forty-one. This New York Times–bestselling biography of the founder of computer science, with a new preface by the author that addresses Turing's royal pardon in 2013, is the definitive account of an extraordinary mind and life.",
      "category": "biography",
      "qttStock": 10,
      "qttSold": 0,
      "price": 10.79,
      "img": "turing.jpeg",
      "id": 13
    },
    {
      "title": "Harry Potter and the Half-Blood Prince",
      "author": "J. K. Rowling",
      "description": "The war against Voldemort is not going well: even Muggle governments are noticing. Ron scans the obituary pages of The Daily Prophet looking for familiar names. Dumbledore is absent from Hogwarts for long stretches of time, and the Order of the Phoenix has already suffered losses.  And yet...  As in all wars, life goes on. Sixth-year students learn to Apparate--and lose a few eyebrows in the process. The Weasley twins expand their business. Teenagers flirt and fight and fall in love. Classes are never straightforward, though Harry receives some extraordinary help from the mysterious Half-Blood Prince.",
      "category": "fantasy",
      "qttStock": 10,
      "qttSold": 0,
      "price": 10.79,
      "img": "potter.jpeg",
      "id": 14
    }
  ]
}